{"backend": "tensorflow", "keras_version": "2.1.6-tf", "class_name": "Model", "config": {"name": "model_2", "output_layers": [["concatenate", 0, 0]], "input_layers": [["anchor", 0, 0], ["positive", 0, 0], ["negative", 0, 0]], "layers": [{"name": "anchor", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 160, 3], "sparse": false, "dtype": "float32", "name": "anchor"}}, {"name": "positive", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 160, 3], "sparse": false, "dtype": "float32", "name": "positive"}}, {"name": "negative", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 160, 3], "sparse": false, "dtype": "float32", "name": "negative"}}, {"name": "model", "inbound_nodes": [[["anchor", 0, 0, {}]], [["positive", 0, 0, {}]], [["negative", 0, 0, {}]]], "class_name": "Model", "config": {"name": "model", "output_layers": [["Dropout", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 160, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"name": "Conv2d_1a_3x3", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [2, 2], "name": "Conv2d_1a_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"name": "Conv2d_1a_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_1a_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Conv2d_1a_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Conv2d_1a_3x3_Activation", "inbound_nodes": [[["Conv2d_1a_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Conv2d_1a_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Conv2d_2a_3x3", "inbound_nodes": [[["Conv2d_1a_3x3_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Conv2d_2a_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"name": "Conv2d_2a_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_2a_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Conv2d_2a_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Conv2d_2a_3x3_Activation", "inbound_nodes": [[["Conv2d_2a_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Conv2d_2a_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Conv2d_2b_3x3", "inbound_nodes": [[["Conv2d_2a_3x3_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 64, "strides": [1, 1], "name": "Conv2d_2b_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Conv2d_2b_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_2b_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Conv2d_2b_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Conv2d_2b_3x3_Activation", "inbound_nodes": [[["Conv2d_2b_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Conv2d_2b_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "MaxPool_3a_3x3", "inbound_nodes": [[["Conv2d_2b_3x3_Activation", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": false, "strides": [2, 2], "name": "MaxPool_3a_3x3", "pool_size": [3, 3], "padding": "valid", "dtype": "float32"}}, {"name": "Conv2d_3b_1x1", "inbound_nodes": [[["MaxPool_3a_3x3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 80, "strides": [1, 1], "name": "Conv2d_3b_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"name": "Conv2d_3b_1x1_BatchNorm", "inbound_nodes": [[["Conv2d_3b_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Conv2d_3b_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Conv2d_3b_1x1_Activation", "inbound_nodes": [[["Conv2d_3b_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Conv2d_3b_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Conv2d_4a_3x3", "inbound_nodes": [[["Conv2d_3b_1x1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 192, "strides": [1, 1], "name": "Conv2d_4a_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"name": "Conv2d_4a_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_4a_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Conv2d_4a_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Conv2d_4a_3x3_Activation", "inbound_nodes": [[["Conv2d_4a_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Conv2d_4a_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Conv2d_4b_3x3", "inbound_nodes": [[["Conv2d_4a_3x3_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 256, "strides": [2, 2], "name": "Conv2d_4b_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"name": "Conv2d_4b_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_4b_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Conv2d_4b_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Conv2d_4b_3x3_Activation", "inbound_nodes": [[["Conv2d_4b_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Conv2d_4b_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1", "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_1_Branch_2_Conv2d_0a_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1", "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_1_Branch_1_Conv2d_0a_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0a_1x1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_1_Branch_2_Conv2d_0b_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0a_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0b_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_1_Branch_0_Conv2d_1x1", "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_1_Branch_0_Conv2d_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0a_1x1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_1_Branch_1_Conv2d_0b_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0b_3x3_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_1_Branch_2_Conv2d_0c_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_1_Branch_0_Conv2d_1x1_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_0_Conv2d_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_1_Branch_0_Conv2d_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0b_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0c_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_1_Branch_0_Conv2d_1x1_Activation", "inbound_nodes": [[["Block35_1_Branch_0_Conv2d_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_1_Branch_0_Conv2d_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_Activation", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_1_Concatenate", "inbound_nodes": [[["Block35_1_Branch_0_Conv2d_1x1_Activation", 0, 0, {}], ["Block35_1_Branch_1_Conv2d_0b_3x3_Activation", 0, 0, {}], ["Block35_1_Branch_2_Conv2d_0c_3x3_Activation", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "Block35_1_Concatenate", "trainable": false, "dtype": "float32", "axis": 3}}, {"name": "Block35_1_Conv2d_1x1", "inbound_nodes": [[["Block35_1_Concatenate", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "filters": 256, "strides": [1, 1], "name": "Block35_1_Conv2d_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "lambda_1", "inbound_nodes": [[["Block35_1_Conv2d_1x1", 0, 0, {}]]], "class_name": "Lambda", "config": {"output_shape_module": null, "output_shape": [17, 17, 256], "trainable": false, "arguments": {"scale": 0.17}, "function_type": "lambda", "name": "lambda_1", "module": "tensorflow.python.keras.layers.core", "function": ["4wIAAAAAAAAAAgAAAAIAAABDAAAAcwgAAAB8AAB8AQAUUykBTqkAKQLaAXjaBXNjYWxlcgEAAABy\nAQAAAPovQzovVXNlcnMvSVM5NjI3My9EZXNrdG9wL2luY2VwdGlvbl9yZXNuZXRfdjEucHnaB3Nj\nYWxpbmcZAAAAcwIAAAAAAQ==\n", null, null], "dtype": "float32", "output_shape_type": "raw"}}, {"name": "add_1", "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}], ["lambda_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": false, "dtype": "float32"}}, {"name": "Block35_1_Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1", "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_2_Branch_2_Conv2d_0a_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1", "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_2_Branch_1_Conv2d_0a_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0a_1x1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_2_Branch_2_Conv2d_0b_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0a_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0b_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_2_Branch_0_Conv2d_1x1", "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_2_Branch_0_Conv2d_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0a_1x1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_2_Branch_1_Conv2d_0b_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0b_3x3_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_2_Branch_2_Conv2d_0c_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_2_Branch_0_Conv2d_1x1_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_0_Conv2d_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_2_Branch_0_Conv2d_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0b_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0c_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_2_Branch_0_Conv2d_1x1_Activation", "inbound_nodes": [[["Block35_2_Branch_0_Conv2d_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_2_Branch_0_Conv2d_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_Activation", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_2_Concatenate", "inbound_nodes": [[["Block35_2_Branch_0_Conv2d_1x1_Activation", 0, 0, {}], ["Block35_2_Branch_1_Conv2d_0b_3x3_Activation", 0, 0, {}], ["Block35_2_Branch_2_Conv2d_0c_3x3_Activation", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "Block35_2_Concatenate", "trainable": false, "dtype": "float32", "axis": 3}}, {"name": "Block35_2_Conv2d_1x1", "inbound_nodes": [[["Block35_2_Concatenate", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "filters": 256, "strides": [1, 1], "name": "Block35_2_Conv2d_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "lambda_2", "inbound_nodes": [[["Block35_2_Conv2d_1x1", 0, 0, {}]]], "class_name": "Lambda", "config": {"output_shape_module": null, "output_shape": [17, 17, 256], "trainable": false, "arguments": {"scale": 0.17}, "function_type": "lambda", "name": "lambda_2", "module": "tensorflow.python.keras.layers.core", "function": ["4wIAAAAAAAAAAgAAAAIAAABDAAAAcwgAAAB8AAB8AQAUUykBTqkAKQLaAXjaBXNjYWxlcgEAAABy\nAQAAAPovQzovVXNlcnMvSVM5NjI3My9EZXNrdG9wL2luY2VwdGlvbl9yZXNuZXRfdjEucHnaB3Nj\nYWxpbmcZAAAAcwIAAAAAAQ==\n", null, null], "dtype": "float32", "output_shape_type": "raw"}}, {"name": "add_2", "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}], ["lambda_2", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_2", "trainable": false, "dtype": "float32"}}, {"name": "Block35_2_Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_2_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1", "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_3_Branch_2_Conv2d_0a_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1", "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_3_Branch_1_Conv2d_0a_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0a_1x1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_3_Branch_2_Conv2d_0b_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0a_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0b_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_3_Branch_0_Conv2d_1x1", "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_3_Branch_0_Conv2d_1x1", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0a_1x1_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_3_Branch_1_Conv2d_0b_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0b_3x3_Activation", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": false, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "name": "Block35_3_Branch_2_Conv2d_0c_3x3", "bias_constraint": null, "activity_regularizer": null, "padding": "same"}}, {"name": "Block35_3_Branch_0_Conv2d_1x1_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_0_Conv2d_1x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_3_Branch_0_Conv2d_1x1_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0b_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0c_3x3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": false, "beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "gamma_constraint": null, "name": "Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm", "gamma_regularizer": null, "momentum": 0.995}}, {"name": "Block35_3_Branch_0_Conv2d_1x1_Activation", "inbound_nodes": [[["Block35_3_Branch_0_Conv2d_1x1_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_3_Branch_0_Conv2d_1x1_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_Activation", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_Activation", "trainable": false, "dtype": "float32", "activation": "relu"}}, {"name": "Block35_3_Concatenate", "inbound_nodes": [[["Block35_3_Branch_0_Conv2d_1x1_Activation", 0, 0, {}], ["Block35_3_Branch_1_Conv2d_0b_3x3_Activation", 0, 0, {}], ["Block35_3_Branch_2_Conv2d_0c_3x3_Activation", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "Block35_3_Concatenate", "trainable": false, "dtype": "float32", "axis": 3}}, {"name": "Block35_3_Conv2d_1x1", "inbound_nodes": [[["Block35_3_Concatenate", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1, "dtype": "float32"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "bias_initializer": {"class_name": 